twixtApp/app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" INNER JOIN "associations" ON "groups"."id" = "associations"."group_id" WHERE "associations"."user_id" = $1  [["user_id", 6]]
---
  def index
    @groups = current_user.groups

INSERT INTO "associations" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 6], ["group_id", 6], ["created_at", "2015-07-29 18:58:39.915183"], ["updated_at", "2015-07-29 18:58:39.915183"]]
INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", " dom's new group"], ["created_at", "2015-07-29 18:58:39.912912"], ["updated_at", "2015-07-29 18:58:39.912912"]]
---
  def create
  	@group = Group.new(group_params)
    @group.associations.build(user_id: session[:user_id] )
    if @group.save