twixtApp/app/controllers/items_controller.rb

  def index
    @items = Item.where(:list_id => @list.id)
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = $1  [["list_id", 11]]

  def create
    @item = @list.items.create(item_params)
    @item.save
    redirect_to group_lists_path(@list.group)
---
INSERT INTO "items" ("name", "image_url", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["image_url", ""], ["list_id", 11], ["created_at", "2015-07-30 01:44:20.398744"], ["updated_at", "2015-07-30 01:44:20.398744"]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 6]]

  def find_list
    @list = List.find_by_id(params[:list_id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 11]]