twixtApp/app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", " WORK!?!"], ["group_id", 6], ["created_at", "2015-07-29 19:00:46.876044"], ["updated_at", "2015-07-29 19:00:46.876044"]]
---
  def create
    @list = @group.lists.create(list_params)

DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 11]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
    @list.destroy
    redirect_to group_lists_path(@list.group)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 6]]
---
  def find_group
    @group = Group.find_by_id(params[:group_id])

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 11]]
---
    def find_list
      @list = List.find_by_id(params[:id])