twixtApp/app/controllers/notifications_controller.rb

	def create
		@notification = @item.notification.new(notification_params)
    @notification.save
---
INSERT INTO "notifications" ("message", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "TEST"], ["phone", "4156526312"], ["created_at", "2015-07-30 17:59:50.139599"], ["updated_at", "2015-07-30 17:59:50.139599"]]

	  def find_item
	    @item = Item.find_by_id(params[:item_id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" IS NULL LIMIT 1