twixtApp/app/controllers/sessions_controller.rb

  def create
    @user = User.create user_params
---
INSERT INTO "users" ("password_digest", "email", "first_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def attempt_login
    if params[:email].present? && params[:password].present?
      found_user = User.where(email: params[:email]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["email", "dom@dom.com"]]

  def find_user
  		@user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]