twixtApp/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 12]]
---
    def find_user
    		@user = User.find_by_id(params[:id])